Documents/РСК_Разнарядка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РСК_Разнарядка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контракт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реестр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТСР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНаправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНаправления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДовЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЗаявки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗаявки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерФилиала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРеестра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРеестра</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийАкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Акты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоручениеЭкспедитору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РСК_Разнарядка/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Неопределено;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Акты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Акты не созданы!",,,,Отказ);
	КонецЕсли;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ПроведениеПоРегиструСостоянияЗаказовПоВыдачеТСР(Отказ);
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17529
//e1cib/data/Документ.Задание?ref=8f35358bc28283324a41cc06ef2294d4
Процедура ПроведениеПоРегиструСостоянияЗаказовПоВыдачеТСР(Отказ)

	//Движения.РСК_СостояниеЗаказовКлиентовПоВыдаче.Очистить();
	//Движения.РСК_СостояниеЗаказовКлиентовПоВыдаче.Записывать = Истина;
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПоручениеЭкспедитору.РСК_ТСР КАК ТСР,
	//	|	ПоручениеЭкспедитору.РСК_Номенклатура КАК Номенклатура,
	//	|	ПоручениеЭкспедитору.РСК_Характеристика КАК Характеристика,
	//	|	ПоручениеЭкспедитору.РСК_Серия КАК Серия,
	//	|	ПоручениеЭкспедитору.РСК_Количество КАК Количество,
	//	|	ПоручениеЭкспедитору.РСК_Цена КАК Цена
	//	|ИЗ
	//	|	Документ.РСК_Разнарядка.Акты КАК РСК_РазнарядкаАкты
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
	//	|		ПО РСК_РазнарядкаАкты.Акт = ПоручениеЭкспедитору.Ссылка
	//	|ГДЕ
	//	|	РСК_РазнарядкаАкты.Ссылка = &Ссылка";
	//
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	Движение = Движения.РСК_СостояниеЗаказовКлиентовПоВыдаче.ДобавитьРасход();
	//	Движение.Период = Дата;
	//	Движение.Заказ = Контракт;
	//	Движение.ТСР = Выборка.ТСР;
	//	Движение.Номенклатура = Выборка.Номенклатура;
	//	Движение.Характеристика = Выборка.Характеристика;
	//	Движение.Серия = Выборка.Серия;
	//	Движение.КСозданию = Выборка.Количество;
	//	Движение.Цена = Выборка.Цена;
	//	
	//	Движение = Движения.РСК_СостояниеЗаказовКлиентовПоВыдаче.ДобавитьПриход();
	//	Движение.Период = Дата;
	//	Движение.Заказ = Контракт;
	//	Движение.ТСР = Выборка.ТСР;
	//	Движение.Номенклатура = Выборка.Номенклатура;
	//	Движение.Характеристика = Выборка.Характеристика;
	//	Движение.Серия = Выборка.Серия;
	//	Движение.КОтгрузке = Выборка.Количество;
	//	Движение.Цена = Выборка.Цена;
	//КонецЦикла;

КонецПроцедуры

#КонецЕсли
